; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v3 - type_3 ?v8 - type_2)
 	      (pred_4 ?v7 - object ?v8 - type_2)
	      (pred_2 ?v3 - type_3 ?v5 - type_1)
	      (pred_1 ?v3 - type_3 ?v7 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v3 - type_3 ?v6 ?v1 - type_2)
       :precondition (and  (pred_3 ?v3 ?v6))
       :effect (and  (pred_3 ?v3 ?v1)
		     (not (pred_3 ?v3 ?v6))))

   (:action op_3
       :parameters (?v3 - type_3 ?v2 - object ?v4 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v2 ?v4) (pred_3 ?v3 ?v4) (pred_2 ?v3 ?v5))
       :effect (and (pred_1 ?v3 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v4)) 
		    (not (pred_2 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_3 ?v2 - object ?v4 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v3 ?v2 ?v5) (pred_3 ?v3 ?v4))
       :effect (and (pred_4 ?v2 ?v4)
		    (pred_2 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v2 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_03 obj_12 - type_3
obj_04 obj_11 obj_08 obj_06 - type_1
obj_02 obj_07 obj_01 obj_13 - type_2
obj_10 obj_05 obj_09 - object)
(:init
(pred_3 obj_03 obj_01)
(pred_2 obj_03 obj_04)
(pred_2 obj_03 obj_11)
(pred_3 obj_12 obj_13)
(pred_2 obj_12 obj_08)
(pred_2 obj_12 obj_06)
(pred_4 obj_10 obj_07)
(pred_4 obj_05 obj_01)
(pred_4 obj_09 obj_13)
)
(:goal
(and
(pred_4 obj_10 obj_07)
(pred_4 obj_05 obj_02)
(pred_4 obj_09 obj_13)
)
)

(:constraints
  (always (not (pred_3 obj_03 obj_02)))
)
)

; plan
1. (op_1 obj_12 obj_13 obj_01)
   deleted: (pred_3 obj_12 obj_13)
   added: (pred_3 obj_12 obj_01)
   goals met: 2 of 3
2. (op_3 obj_12 obj_05 obj_01 obj_06)
   deleted: (pred_4 obj_05 obj_01) (pred_2 obj_12 obj_06)
   added: (pred_1 obj_12 obj_05 obj_06)
   goals met: 2 of 3
3. (op_1 obj_12 obj_01 obj_02)
   deleted: (pred_3 obj_12 obj_01)
   added: (pred_3 obj_12 obj_02)
   goals met: 2 of 3
4. (op_2 obj_12 obj_05 obj_02 obj_06)
   deleted: (pred_1 obj_12 obj_05 obj_06)
   added: (pred_4 obj_05 obj_02) (pred_2 obj_12 obj_06)
   goals met: 3 of 3
